task_1/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    # Let's imagine that writing to the database lasts at least 20 seconds :(
    # !!!Don't change this line!!!
    sleep(20)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1212121"], ["body", "21212121222"], ["created_at", "2022-04-29 12:36:21.712199"], ["updated_at", "2022-04-29 12:36:21.712199"]]